torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723cs/hal/hal_com.c
	RTW_INFO("%s", buf);
}

u8 rtw_hal_get_port(_adapter *adapter)
{
	u8 hw_port = get_hw_port(adapter);
#ifdef CONFIG_CLIENT_PORT_CFG
	u8 clt_port = get_clt_port(adapter);

	if (clt_port)
		hw_port = clt_port;

#ifdef DBG_HW_PORT
	if (MLME_IS_STA(adapter) && (adapter->client_id != MAX_CLIENT_PORT_NUM)) {
		if(hw_port == CLT_PORT_INVALID) {
			RTW_ERR(ADPT_FMT" @@@@@ Client port == 0 @@@@@\n", ADPT_ARG(adapter));
			rtw_warn_on(1);
		}
	}
	#ifdef CONFIG_AP_MODE
	else if (MLME_IS_AP(adapter) || MLME_IS_MESH(adapter)) {
		if (hw_port != HW_PORT0) {
			RTW_ERR(ADPT_FMT" @@@@@ AP / MESH port != 0 @@@@@\n", ADPT_ARG(adapter));
			rtw_warn_on(1);
		}
	}
	#endif
	if (0)
		RTW_INFO(ADPT_FMT" - HP:%d,CP:%d\n", ADPT_ARG(adapter), get_hw_port(adapter), get_clt_port(adapter));
#endif /*DBG_HW_PORT*/

#endif/*CONFIG_CLIENT_PORT_CFG*/

	return hw_port;
}

#define	EEPROM_CHANNEL_PLAN_BY_HW_MASK	0x80

/*
 * Description:
 *	Use hardware(efuse), driver parameter(registry) and default channel plan
 *	to decide which one should be used.
 *
 * Parameters:
 *	padapter			pointer of adapter
 *	hw_alpha2		country code from HW (efuse/eeprom/mapfile)
 *	hw_chplan		channel plan from HW (efuse/eeprom/mapfile)
 *						BIT[7] software configure mode; 0:Enable, 1:disable
 *						BIT[6:0] Channel Plan
 *	sw_alpha2		country code from HW (registry/module param)
 *	sw_chplan		channel plan from SW (registry/module param)
 *	AutoLoadFail		efuse autoload fail or not
 *
 */
void hal_com_config_channel_plan(
		PADAPTER padapter,
		char *hw_alpha2,
		u8 hw_chplan,
		char *sw_alpha2,
		u8 sw_chplan,
		BOOLEAN AutoLoadFail
)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(padapter);
	PHAL_DATA_TYPE	pHalData;
	u8 force_hw_chplan = _FALSE;
	int chplan = -1;
	const struct country_chplan *country_ent = NULL, *ent;
	u8 def_chplan = 0x7F; /* Realtek define,  used when HW, SW both invalid */

	pHalData = GET_HAL_DATA(padapter);

	/* treat 0xFF as invalid value, bypass hw_chplan & force_hw_chplan parsing */
	if (hw_chplan == 0xFF)
		goto chk_hw_country_code;

	if (AutoLoadFail == _TRUE)
		goto chk_sw_config;

#ifndef CONFIG_FORCE_SW_CHANNEL_PLAN
	if (hw_chplan & EEPROM_CHANNEL_PLAN_BY_HW_MASK)
		force_hw_chplan = _TRUE;
#endif

	hw_chplan &= (~EEPROM_CHANNEL_PLAN_BY_HW_MASK);

chk_hw_country_code:
	if (hw_alpha2 && !IS_ALPHA2_NO_SPECIFIED(hw_alpha2)) {
		ent = rtw_get_chplan_from_country(hw_alpha2);
		if (ent) {
			/* get chplan from hw country code, by pass hw chplan setting */
			country_ent = ent;
			chplan = ent->chplan;
			goto chk_sw_config;
		} else
			RTW_PRINT("%s unsupported hw_alpha2:\"%c%c\"\n", __func__, hw_alpha2[0], hw_alpha2[1]);
	}

	if (rtw_is_channel_plan_valid(hw_chplan))
		chplan = hw_chplan;
	else if (force_hw_chplan == _TRUE) {
		RTW_PRINT("%s unsupported hw_chplan:0x%02X\n", __func__, hw_chplan);
		/* hw infomaton invalid, refer to sw information */
		force_hw_chplan = _FALSE;
	}

chk_sw_config:
	if (force_hw_chplan == _TRUE)
		goto done;

	if (sw_alpha2 && !IS_ALPHA2_NO_SPECIFIED(sw_alpha2)) {
		ent = rtw_get_chplan_from_country(sw_alpha2);
		if (ent) {
			/* get chplan from sw country code, by pass sw chplan setting */
			country_ent = ent;
			chplan = ent->chplan;
			goto done;
		} else
			RTW_PRINT("%s unsupported sw_alpha2:\"%c%c\"\n", __func__, sw_alpha2[0], sw_alpha2[1]);
	}

	if (rtw_is_channel_plan_valid(sw_chplan)) {
		/* cancel hw_alpha2 because chplan is specified by sw_chplan*/
		country_ent = NULL;
		chplan = sw_chplan;
	} else if (sw_chplan != RTW_CHPLAN_UNSPECIFIED)
		RTW_PRINT("%s unsupported sw_chplan:0x%02X\n", __func__, sw_chplan);

done:
	if (chplan == -1) {
		RTW_PRINT("%s use def_chplan:0x%02X\n", __func__, def_chplan);
		chplan = def_chplan;
	} else if (country_ent) {
		RTW_PRINT("%s country code:\"%c%c\" with chplan:0x%02X\n", __func__
			, country_ent->alpha2[0], country_ent->alpha2[1], country_ent->chplan);
	} else
		RTW_PRINT("%s chplan:0x%02X\n", __func__, chplan);

	rfctl->country_ent = country_ent;
	rfctl->ChannelPlan = chplan;
	pHalData->bDisableSWChannelPlan = force_hw_chplan;
}

BOOLEAN
HAL_IsLegalChannel(
		PADAPTER	Adapter,
		u32			Channel
)
{
	BOOLEAN bLegalChannel = _TRUE;

	if (Channel > 14) {
		if (is_supported_5g(Adapter->registrypriv.wireless_mode) == _FALSE) {
			bLegalChannel = _FALSE;
			RTW_INFO("Channel > 14 but wireless_mode do not support 5G\n");
		}
	} else if ((Channel <= 14) && (Channel >= 1)) {
		if (IsSupported24G(Adapter->registrypriv.wireless_mode) == _FALSE) {
			bLegalChannel = _FALSE;
			RTW_INFO("(Channel <= 14) && (Channel >=1) but wireless_mode do not support 2.4G\n");
		}
	} else {
		bLegalChannel = _FALSE;
		RTW_INFO("Channel is Invalid !!!\n");
	}

	return bLegalChannel;
}

static const u8 _MRateToHwRate[MGN_UNKNOWN] = {
	[MGN_1M] = DESC_RATE1M,
	[MGN_2M] = DESC_RATE2M,
	[MGN_5_5M] = DESC_RATE5_5M,
	[MGN_11M] = DESC_RATE11M,
	[MGN_6M] = DESC_RATE6M,
	[MGN_9M] = DESC_RATE9M,
	[MGN_12M] = DESC_RATE12M,
	[MGN_18M] = DESC_RATE18M,
	[MGN_24M] = DESC_RATE24M,
	[MGN_36M] = DESC_RATE36M,
	[MGN_48M] = DESC_RATE48M,
	[MGN_54M] = DESC_RATE54M,
	[MGN_MCS0] = DESC_RATEMCS0,
	[MGN_MCS1] = DESC_RATEMCS1,
	[MGN_MCS2] = DESC_RATEMCS2,
	[MGN_MCS3] = DESC_RATEMCS3,
	[MGN_MCS4] = DESC_RATEMCS4,
	[MGN_MCS5] = DESC_RATEMCS5,
	[MGN_MCS6] = DESC_RATEMCS6,
	[MGN_MCS7] = DESC_RATEMCS7,
	[MGN_MCS8] = DESC_RATEMCS8,
	[MGN_MCS9] = DESC_RATEMCS9,
	[MGN_MCS10] = DESC_RATEMCS10,
	[MGN_MCS11] = DESC_RATEMCS11,
	[MGN_MCS12] = DESC_RATEMCS12,
	[MGN_MCS13] = DESC_RATEMCS13,
	[MGN_MCS14] = DESC_RATEMCS14,
	[MGN_MCS15] = DESC_RATEMCS15,
	[MGN_MCS16] = DESC_RATEMCS16,
	[MGN_MCS17] = DESC_RATEMCS17,
	[MGN_MCS18] = DESC_RATEMCS18,
	[MGN_MCS19] = DESC_RATEMCS19,
	[MGN_MCS20] = DESC_RATEMCS20,
	[MGN_MCS21] = DESC_RATEMCS21,
	[MGN_MCS22] = DESC_RATEMCS22,
	[MGN_MCS23] = DESC_RATEMCS23,
	[MGN_MCS24] = DESC_RATEMCS24,
	[MGN_MCS25] = DESC_RATEMCS25,
	[MGN_MCS26] = DESC_RATEMCS26,
	[MGN_MCS27] = DESC_RATEMCS27,
	[MGN_MCS28] = DESC_RATEMCS28,
	[MGN_MCS29] = DESC_RATEMCS29,
	[MGN_MCS30] = DESC_RATEMCS30,
	[MGN_MCS31] = DESC_RATEMCS31,
	[MGN_VHT1SS_MCS0] = DESC_RATEVHTSS1MCS0,
	[MGN_VHT1SS_MCS1] = DESC_RATEVHTSS1MCS1,
	[MGN_VHT1SS_MCS2] = DESC_RATEVHTSS1MCS2,
	[MGN_VHT1SS_MCS3] = DESC_RATEVHTSS1MCS3,
	[MGN_VHT1SS_MCS4] = DESC_RATEVHTSS1MCS4,
	[MGN_VHT1SS_MCS5] = DESC_RATEVHTSS1MCS5,
	[MGN_VHT1SS_MCS6] = DESC_RATEVHTSS1MCS6,
	[MGN_VHT1SS_MCS7] = DESC_RATEVHTSS1MCS7,
	[MGN_VHT1SS_MCS8] = DESC_RATEVHTSS1MCS8,
	[MGN_VHT1SS_MCS9] = DESC_RATEVHTSS1MCS9,
	[MGN_VHT2SS_MCS0] = DESC_RATEVHTSS2MCS0,
	[MGN_VHT2SS_MCS1] = DESC_RATEVHTSS2MCS1,
	[MGN_VHT2SS_MCS2] = DESC_RATEVHTSS2MCS2,
	[MGN_VHT2SS_MCS3] = DESC_RATEVHTSS2MCS3,
	[MGN_VHT2SS_MCS4] = DESC_RATEVHTSS2MCS4,
	[MGN_VHT2SS_MCS5] = DESC_RATEVHTSS2MCS5,
	[MGN_VHT2SS_MCS6] = DESC_RATEVHTSS2MCS6,
	[MGN_VHT2SS_MCS7] = DESC_RATEVHTSS2MCS7,
	[MGN_VHT2SS_MCS8] = DESC_RATEVHTSS2MCS8,
	[MGN_VHT2SS_MCS9] = DESC_RATEVHTSS2MCS9,
	[MGN_VHT3SS_MCS0] = DESC_RATEVHTSS3MCS0,
	[MGN_VHT3SS_MCS1] = DESC_RATEVHTSS3MCS1,
	[MGN_VHT3SS_MCS2] = DESC_RATEVHTSS3MCS2,
	[MGN_VHT3SS_MCS3] = DESC_RATEVHTSS3MCS3,
	[MGN_VHT3SS_MCS4] = DESC_RATEVHTSS3MCS4,
	[MGN_VHT3SS_MCS5] = DESC_RATEVHTSS3MCS5,
	[MGN_VHT3SS_MCS6] = DESC_RATEVHTSS3MCS6,
	[MGN_VHT3SS_MCS7] = DESC_RATEVHTSS3MCS7,
	[MGN_VHT3SS_MCS8] = DESC_RATEVHTSS3MCS8,
	[MGN_VHT3SS_MCS9] = DESC_RATEVHTSS3MCS9,
	[MGN_VHT4SS_MCS0] = DESC_RATEVHTSS4MCS0,
	[MGN_VHT4SS_MCS1] = DESC_RATEVHTSS4MCS1,
	[MGN_VHT4SS_MCS2] = DESC_RATEVHTSS4MCS2,
	[MGN_VHT4SS_MCS3] = DESC_RATEVHTSS4MCS3,
	[MGN_VHT4SS_MCS4] = DESC_RATEVHTSS4MCS4,
	[MGN_VHT4SS_MCS5] = DESC_RATEVHTSS4MCS5,
	[MGN_VHT4SS_MCS6] = DESC_RATEVHTSS4MCS6,
	[MGN_VHT4SS_MCS7] = DESC_RATEVHTSS4MCS7,
	[MGN_VHT4SS_MCS8] = DESC_RATEVHTSS4MCS8,
	[MGN_VHT4SS_MCS9] = DESC_RATEVHTSS4MCS9,
};

u8 MRateToHwRate(enum MGN_RATE rate)
{
	u8 hw_rate = DESC_RATE1M; /* default value, also is zero */

