torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723cs/hal/hal_com.c
	if (rate < MGN_UNKNOWN)
		hw_rate = _MRateToHwRate[rate];

	if (rate != MGN_1M && hw_rate == DESC_RATE1M)
		RTW_WARN("Invalid rate 0x%x in %s\n", rate, __FUNCTION__);

	return hw_rate;
}

const char * const _HDATA_RATE[DESC_RATE_NUM + 1] = {
	[DESC_RATE1M] = "CCK_1M",
	[DESC_RATE2M] = "CCK_2M",
	[DESC_RATE5_5M] = "CCK5_5M",
	[DESC_RATE11M] = "CCK_11M",
	[DESC_RATE6M] = "OFDM_6M",
	[DESC_RATE9M] = "OFDM_9M",
	[DESC_RATE12M] = "OFDM_12M",
	[DESC_RATE18M] = "OFDM_18M",
	[DESC_RATE24M] = "OFDM_24M",
	[DESC_RATE36M] = "OFDM_36M",
	[DESC_RATE48M] = "OFDM_48M",
	[DESC_RATE54M] = "OFDM_54M",
	[DESC_RATEMCS0] = "MCS0",
	[DESC_RATEMCS1] = "MCS1",
	[DESC_RATEMCS2] = "MCS2",
	[DESC_RATEMCS3] = "MCS3",
	[DESC_RATEMCS4] = "MCS4",
	[DESC_RATEMCS5] = "MCS5",
	[DESC_RATEMCS6] = "MCS6",
	[DESC_RATEMCS7] = "MCS7",
	[DESC_RATEMCS8] = "MCS8",
	[DESC_RATEMCS9] = "MCS9",
	[DESC_RATEMCS10] = "MCS10",
	[DESC_RATEMCS11] = "MCS11",
	[DESC_RATEMCS12] = "MCS12",
	[DESC_RATEMCS13] = "MCS13",
	[DESC_RATEMCS14] = "MCS14",
	[DESC_RATEMCS15] = "MCS15",
	[DESC_RATEMCS16] = "MCS16",
	[DESC_RATEMCS17] = "MCS17",
	[DESC_RATEMCS18] = "MCS18",
	[DESC_RATEMCS19] = "MCS19",
	[DESC_RATEMCS20] = "MCS20",
	[DESC_RATEMCS21] = "MCS21",
	[DESC_RATEMCS22] = "MCS22",
	[DESC_RATEMCS23] = "MCS23",
	[DESC_RATEMCS24] = "MCS24",
	[DESC_RATEMCS25] = "MCS25",
	[DESC_RATEMCS26] = "MCS26",
	[DESC_RATEMCS27] = "MCS27",
	[DESC_RATEMCS28] = "MCS28",
	[DESC_RATEMCS29] = "MCS29",
	[DESC_RATEMCS30] = "MCS30",
	[DESC_RATEMCS31] = "MCS31",
	[DESC_RATEVHTSS1MCS0] = "VHT1SMCS0",
	[DESC_RATEVHTSS1MCS1] = "VHT1SMCS1",
	[DESC_RATEVHTSS1MCS2] = "VHT1SMCS2",
	[DESC_RATEVHTSS1MCS3] = "VHT1SMCS3",
	[DESC_RATEVHTSS1MCS4] = "VHT1SMCS4",
	[DESC_RATEVHTSS1MCS5] = "VHT1SMCS5",
	[DESC_RATEVHTSS1MCS6] = "VHT1SMCS6",
	[DESC_RATEVHTSS1MCS7] = "VHT1SMCS7",
	[DESC_RATEVHTSS1MCS8] = "VHT1SMCS8",
	[DESC_RATEVHTSS1MCS9] = "VHT1SMCS9",
	[DESC_RATEVHTSS2MCS0] = "VHT2SMCS0",
	[DESC_RATEVHTSS2MCS1] = "VHT2SMCS1",
	[DESC_RATEVHTSS2MCS2] = "VHT2SMCS2",
	[DESC_RATEVHTSS2MCS3] = "VHT2SMCS3",
	[DESC_RATEVHTSS2MCS4] = "VHT2SMCS4",
	[DESC_RATEVHTSS2MCS5] = "VHT2SMCS5",
	[DESC_RATEVHTSS2MCS6] = "VHT2SMCS6",
	[DESC_RATEVHTSS2MCS7] = "VHT2SMCS7",
	[DESC_RATEVHTSS2MCS8] = "VHT2SMCS8",
	[DESC_RATEVHTSS2MCS9] = "VHT2SMCS9",
	[DESC_RATEVHTSS3MCS0] = "VHT3SMCS0",
	[DESC_RATEVHTSS3MCS1] = "VHT3SMCS1",
	[DESC_RATEVHTSS3MCS2] = "VHT3SMCS2",
	[DESC_RATEVHTSS3MCS3] = "VHT3SMCS3",
	[DESC_RATEVHTSS3MCS4] = "VHT3SMCS4",
	[DESC_RATEVHTSS3MCS5] = "VHT3SMCS5",
	[DESC_RATEVHTSS3MCS6] = "VHT3SMCS6",
	[DESC_RATEVHTSS3MCS7] = "VHT3SMCS7",
	[DESC_RATEVHTSS3MCS8] = "VHT3SMCS8",
	[DESC_RATEVHTSS3MCS9] = "VHT3SMCS9",
	[DESC_RATEVHTSS4MCS0] = "VHT4SMCS0",
	[DESC_RATEVHTSS4MCS1] = "VHT4SMCS1",
	[DESC_RATEVHTSS4MCS2] = "VHT4SMCS2",
	[DESC_RATEVHTSS4MCS3] = "VHT4SMCS3",
	[DESC_RATEVHTSS4MCS4] = "VHT4SMCS4",
	[DESC_RATEVHTSS4MCS5] = "VHT4SMCS5",
	[DESC_RATEVHTSS4MCS6] = "VHT4SMCS6",
	[DESC_RATEVHTSS4MCS7] = "VHT4SMCS7",
	[DESC_RATEVHTSS4MCS8] = "VHT4SMCS8",
	[DESC_RATEVHTSS4MCS9] = "VHT4SMCS9",
	[DESC_RATE_NUM] = "UNKNOWN",
};

static const u8 _hw_rate_to_m_rate[DESC_RATE_NUM] = {
	[DESC_RATE1M] = MGN_1M,
	[DESC_RATE2M] = MGN_2M,
	[DESC_RATE5_5M] = MGN_5_5M,
	[DESC_RATE11M] = MGN_11M,
	[DESC_RATE6M] = MGN_6M,
	[DESC_RATE9M] = MGN_9M,
	[DESC_RATE12M] = MGN_12M,
	[DESC_RATE18M] = MGN_18M,
	[DESC_RATE24M] = MGN_24M,
	[DESC_RATE36M] = MGN_36M,
	[DESC_RATE48M] = MGN_48M,
	[DESC_RATE54M] = MGN_54M,
	[DESC_RATEMCS0] = MGN_MCS0,
	[DESC_RATEMCS1] = MGN_MCS1,
	[DESC_RATEMCS2] = MGN_MCS2,
	[DESC_RATEMCS3] = MGN_MCS3,
	[DESC_RATEMCS4] = MGN_MCS4,
	[DESC_RATEMCS5] = MGN_MCS5,
	[DESC_RATEMCS6] = MGN_MCS6,
	[DESC_RATEMCS7] = MGN_MCS7,
	[DESC_RATEMCS8] = MGN_MCS8,
	[DESC_RATEMCS9] = MGN_MCS9,
	[DESC_RATEMCS10] = MGN_MCS10,
	[DESC_RATEMCS11] = MGN_MCS11,
	[DESC_RATEMCS12] = MGN_MCS12,
	[DESC_RATEMCS13] = MGN_MCS13,
	[DESC_RATEMCS14] = MGN_MCS14,
	[DESC_RATEMCS15] = MGN_MCS15,
	[DESC_RATEMCS16] = MGN_MCS16,
	[DESC_RATEMCS17] = MGN_MCS17,
	[DESC_RATEMCS18] = MGN_MCS18,
	[DESC_RATEMCS19] = MGN_MCS19,
	[DESC_RATEMCS20] = MGN_MCS20,
	[DESC_RATEMCS21] = MGN_MCS21,
	[DESC_RATEMCS22] = MGN_MCS22,
	[DESC_RATEMCS23] = MGN_MCS23,
	[DESC_RATEMCS24] = MGN_MCS24,
	[DESC_RATEMCS25] = MGN_MCS25,
	[DESC_RATEMCS26] = MGN_MCS26,
	[DESC_RATEMCS27] = MGN_MCS27,
	[DESC_RATEMCS28] = MGN_MCS28,
	[DESC_RATEMCS29] = MGN_MCS29,
	[DESC_RATEMCS30] = MGN_MCS30,
	[DESC_RATEMCS31] = MGN_MCS31,
	[DESC_RATEVHTSS1MCS0] = MGN_VHT1SS_MCS0,
	[DESC_RATEVHTSS1MCS1] = MGN_VHT1SS_MCS1,
	[DESC_RATEVHTSS1MCS2] = MGN_VHT1SS_MCS2,
	[DESC_RATEVHTSS1MCS3] = MGN_VHT1SS_MCS3,
	[DESC_RATEVHTSS1MCS4] = MGN_VHT1SS_MCS4,
	[DESC_RATEVHTSS1MCS5] = MGN_VHT1SS_MCS5,
	[DESC_RATEVHTSS1MCS6] = MGN_VHT1SS_MCS6,
	[DESC_RATEVHTSS1MCS7] = MGN_VHT1SS_MCS7,
	[DESC_RATEVHTSS1MCS8] = MGN_VHT1SS_MCS8,
	[DESC_RATEVHTSS1MCS9] = MGN_VHT1SS_MCS9,
	[DESC_RATEVHTSS2MCS0] = MGN_VHT2SS_MCS0,
	[DESC_RATEVHTSS2MCS1] = MGN_VHT2SS_MCS1,
	[DESC_RATEVHTSS2MCS2] = MGN_VHT2SS_MCS2,
	[DESC_RATEVHTSS2MCS3] = MGN_VHT2SS_MCS3,
	[DESC_RATEVHTSS2MCS4] = MGN_VHT2SS_MCS4,
	[DESC_RATEVHTSS2MCS5] = MGN_VHT2SS_MCS5,
	[DESC_RATEVHTSS2MCS6] = MGN_VHT2SS_MCS6,
	[DESC_RATEVHTSS2MCS7] = MGN_VHT2SS_MCS7,
	[DESC_RATEVHTSS2MCS8] = MGN_VHT2SS_MCS8,
	[DESC_RATEVHTSS2MCS9] = MGN_VHT2SS_MCS9,
	[DESC_RATEVHTSS3MCS0] = MGN_VHT3SS_MCS0,
	[DESC_RATEVHTSS3MCS1] = MGN_VHT3SS_MCS1,
	[DESC_RATEVHTSS3MCS2] = MGN_VHT3SS_MCS2,
	[DESC_RATEVHTSS3MCS3] = MGN_VHT3SS_MCS3,
	[DESC_RATEVHTSS3MCS4] = MGN_VHT3SS_MCS4,
	[DESC_RATEVHTSS3MCS5] = MGN_VHT3SS_MCS5,
	[DESC_RATEVHTSS3MCS6] = MGN_VHT3SS_MCS6,
	[DESC_RATEVHTSS3MCS7] = MGN_VHT3SS_MCS7,
	[DESC_RATEVHTSS3MCS8] = MGN_VHT3SS_MCS8,
	[DESC_RATEVHTSS3MCS9] = MGN_VHT3SS_MCS9,
	[DESC_RATEVHTSS4MCS0] = MGN_VHT4SS_MCS0,
	[DESC_RATEVHTSS4MCS1] = MGN_VHT4SS_MCS1,
	[DESC_RATEVHTSS4MCS2] = MGN_VHT4SS_MCS2,
	[DESC_RATEVHTSS4MCS3] = MGN_VHT4SS_MCS3,
	[DESC_RATEVHTSS4MCS4] = MGN_VHT4SS_MCS4,
	[DESC_RATEVHTSS4MCS5] = MGN_VHT4SS_MCS5,
	[DESC_RATEVHTSS4MCS6] = MGN_VHT4SS_MCS6,
	[DESC_RATEVHTSS4MCS7] = MGN_VHT4SS_MCS7,
	[DESC_RATEVHTSS4MCS8] = MGN_VHT4SS_MCS8,
	[DESC_RATEVHTSS4MCS9] = MGN_VHT4SS_MCS9,
};

u8 hw_rate_to_m_rate(u8 hw_rate)
{
	u8 rate = MGN_1M; /* default value */

	if (hw_rate < DESC_RATE_NUM)
		rate = _hw_rate_to_m_rate[hw_rate];
	else
		RTW_WARN("Invalid hw_rate 0x%x in %s\n", hw_rate, __FUNCTION__);

	return rate;
}

#ifdef CONFIG_RTW_DEBUG
void dump_hw_rate_map_test(void *sel)
{
	RATE_SECTION rs;
	u8 hw_rate;
	enum MGN_RATE m_rate;
	int i;

	for (rs = 0; rs < RATE_SECTION_NUM; rs++) {
		for (i = 0; i < rates_by_sections[rs].rate_num; i++) {
			hw_rate = MRateToHwRate(rates_by_sections[rs].rates[i]);
			RTW_PRINT_SEL(sel, "m_rate:%s(%d) to hw_rate:%s(%d)\n"
				, MGN_RATE_STR(rates_by_sections[rs].rates[i]), rates_by_sections[rs].rates[i]
				, HDATA_RATE(hw_rate), hw_rate
			);
		}
		if (rs == HT_4SS) { /* show MCS32 after MCS31 */
			hw_rate = MRateToHwRate(MGN_MCS32);
			RTW_PRINT_SEL(sel, "m_rate:%s(%d) to hw_rate:%s(%d)\n"
				, MGN_RATE_STR(MGN_MCS32), MGN_MCS32
				, HDATA_RATE(hw_rate), hw_rate
			);
		}
	}
	hw_rate = MRateToHwRate(MGN_UNKNOWN);
	RTW_PRINT_SEL(sel, "m_rate:%s(%d) to hw_rate:%s(%d)\n"
		, MGN_RATE_STR(MGN_UNKNOWN), MGN_UNKNOWN
		, HDATA_RATE(hw_rate), hw_rate
	);

	for (i = DESC_RATE1M; i <= DESC_RATE_NUM; i++) {
		m_rate = hw_rate_to_m_rate(i);
		RTW_PRINT_SEL(sel, "hw_rate:%s(%d) to m_rate:%s(%d)\n"
			, HDATA_RATE(i), i
			, MGN_RATE_STR(m_rate), m_rate
		);
	}
}
#endif /* CONFIG_RTW_DEBUG */

