torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723cs/hal/hal_com.c
	#ifdef CONFIG_IPV6
			if (ppwrpriv->wowlan_ns_offload_en == _TRUE) {
				RTW_INFO("enable NS offload\n");
				SET_H2CCMD_REMOTE_WAKE_CTRL_NDP_OFFLOAD_EN(
					u1H2CRemoteWakeCtrlParm, enable);
			}
	
			/*
			 * filter NetBios name service pkt to avoid being waked-up
			 * by this kind of unicast pkt this exceptional modification
			 * is used for match competitor's behavior
			 */
	
			SET_H2CCMD_REMOTE_WAKE_CTRL_NBNS_FILTER_EN(
				u1H2CRemoteWakeCtrlParm, enable);
	#endif /*CONFIG_IPV6*/
#if 0 /* replaced by WOWLAN pattern match */
	#ifdef CONFIG_RTL8192F
			if (IS_HARDWARE_TYPE_8192F(adapter)){
				SET_H2CCMD_REMOTE_WAKE_CTRL_FW_UNICAST_EN(
					u1H2CRemoteWakeCtrlParm, enable);
			}
	#endif /* CONFIG_RTL8192F */
#endif
			if ((psecuritypriv->dot11PrivacyAlgrthm == _AES_) ||
				(psecuritypriv->dot11PrivacyAlgrthm == _TKIP_) ||
				(psecuritypriv->dot11PrivacyAlgrthm == _NO_PRIVACY_)) {
				SET_H2CCMD_REMOTE_WAKE_CTRL_ARP_ACTION(
					u1H2CRemoteWakeCtrlParm, 0);
			} else { /* WEP etc. */
				if (arp_en)
					SET_H2CCMD_REMOTE_WAKE_CTRL_ARP_ACTION(
						u1H2CRemoteWakeCtrlParm, 1);
			}
	
			if (psecuritypriv->dot11PrivacyAlgrthm == _TKIP_) {
#ifdef CONFIG_GTK_OL
				if(_rtw_wow_chk_cap(adapter, WOW_CAP_TKIP_OL))
					SET_H2CCMD_REMOTE_WAKE_CTRL_TKIP_OFFLOAD_EN(
						u1H2CRemoteWakeCtrlParm, enable);
#endif /* CONFIG_GTK_OL */
				if (IS_HARDWARE_TYPE_8188E(adapter) ||
				    IS_HARDWARE_TYPE_8812(adapter)) {
					SET_H2CCMD_REMOTE_WAKE_CTRL_TKIP_OFFLOAD_EN(
						u1H2CRemoteWakeCtrlParm, 0);
					if (arp_en)
						SET_H2CCMD_REMOTE_WAKE_CTRL_ARP_ACTION(
							u1H2CRemoteWakeCtrlParm, 1);
				}
			}
	
			SET_H2CCMD_REMOTE_WAKE_CTRL_FW_PARSING_UNTIL_WAKEUP(
				u1H2CRemoteWakeCtrlParm, 1);
		}
	#ifdef CONFIG_PNO_SUPPORT
		else {
			SET_H2CCMD_REMOTE_WAKECTRL_ENABLE(
				u1H2CRemoteWakeCtrlParm, enable);
			SET_H2CCMD_REMOTE_WAKE_CTRL_NLO_OFFLOAD_EN(
				u1H2CRemoteWakeCtrlParm, enable);
		}
	#endif
	
	#ifdef CONFIG_P2P_WOWLAN
		if (_TRUE == ppwrpriv->wowlan_p2p_mode) {
			RTW_INFO("P2P OFFLOAD ENABLE\n");
			SET_H2CCMD_REMOTE_WAKE_CTRL_P2P_OFFLAD_EN(u1H2CRemoteWakeCtrlParm, 1);
		} else {
			RTW_INFO("P2P OFFLOAD DISABLE\n");
			SET_H2CCMD_REMOTE_WAKE_CTRL_P2P_OFFLAD_EN(u1H2CRemoteWakeCtrlParm, 0);
		}
	#endif /* CONFIG_P2P_WOWLAN */
	}


	ret = rtw_hal_fill_h2c_cmd(adapter,
				   H2C_REMOTE_WAKE_CTRL,
				   H2C_REMOTE_WAKE_CTRL_LEN,
				   u1H2CRemoteWakeCtrlParm);
	return ret;
}

#ifdef CONFIG_WAR_OFFLOAD
static u8 rtw_hal_set_war_offload_ctrl_cmd(_adapter *adapter, u8 enable)
{
	struct pwrctrl_priv *ppwrpriv = adapter_to_pwrctl(adapter);
	u8 u1H2CWarOffloadParm[H2C_WAR_OFFLOAD_LEN] = {0};
	u8 ret = _FAIL;

	RTW_INFO("%s(): enable=%d\n", __func__, enable);

	if (_TRUE == ppwrpriv->wowlan_war_offload_mode) {
		SET_H2CCMD_WAR_CFG_EN(u1H2CWarOffloadParm, enable);
		SET_H2CCMD_WAR_CFG_ARP_RSP_EN(u1H2CWarOffloadParm, 1);

#ifdef CONFIG_OFFLOAD_MDNS_V4
		if (WAR_MDNS_V4_RSP_EN & ppwrpriv->wowlan_war_offload_ctrl) {
			SET_H2CCMD_WAR_CFG_MDNSV4_RSP_EN(u1H2CWarOffloadParm, 1);
		}
		if (WAR_MDNS_V4_WAKEUP_EN& ppwrpriv->wowlan_war_offload_ctrl) {
			SET_H2CCMD_WAR_CFG_MDNSV4_WAKE_EN(u1H2CWarOffloadParm, 1);
		}
#endif /* CONFIG_OFFLOAD_MDNS_V4 */

#ifdef CONFIG_OFFLOAD_MDNS_V6
		if (WAR_MDNS_V6_RSP_EN & ppwrpriv->wowlan_war_offload_ctrl) {
			SET_H2CCMD_WAR_CFG_MDNSV6_RSP_EN(u1H2CWarOffloadParm, 1);
		}
		if (WAR_MDNS_V6_WAKEUP_EN & ppwrpriv->wowlan_war_offload_ctrl) {
			SET_H2CCMD_WAR_CFG_MDNSV6_WAKE_EN(u1H2CWarOffloadParm, 1);
		}
#endif /* CONFIG_OFFLOAD_MDNS_V6 */

	}

	ret = rtw_hal_fill_h2c_cmd(adapter,
					H2C_WAR_OFFLOAD,
					H2C_WAR_OFFLOAD_LEN,
					u1H2CWarOffloadParm);
	return ret;
}

static u8 rtw_hal_set_war_offload_parm(_adapter *adapter, PRSVDPAGE_LOC rsvdpageloc)
{
	struct pwrctrl_priv *ppwrpriv = adapter_to_pwrctl(adapter);
	u8 u1H2CWarOfldParm[H2C_WAROFLD_RSVDPAGE1_LEN] = {0};
	u8 ret = _FAIL;

	SET_H2CCMD_WAROFLD_RSVDPAGE1_LOC_PARM(u1H2CWarOfldParm, rsvdpageloc->LocIpParm);
	RTW_INFO("%s(): LocIpParm = %d\n", __func__, rsvdpageloc->LocIpParm);


	ret = rtw_hal_fill_h2c_cmd(adapter,
					H2C_WAROFLD_RSVDPAGE1,
					H2C_WAROFLD_RSVDPAGE1_LEN,
					u1H2CWarOfldParm);

	return ret;
}
#endif /* CONFIG_WAR_OFFLOAD */



static u8 rtw_hal_set_global_info_cmd(_adapter *adapter, u8 group_alg, u8 pairwise_alg)
{
	u8 ret = _FAIL;
	u8 u1H2CAOACGlobalInfoParm[H2C_AOAC_GLOBAL_INFO_LEN] = {0};

	RTW_INFO("%s(): group_alg=%d pairwise_alg=%d\n",
		 __func__, group_alg, pairwise_alg);
	SET_H2CCMD_AOAC_GLOBAL_INFO_PAIRWISE_ENC_ALG(u1H2CAOACGlobalInfoParm,
			pairwise_alg);
	SET_H2CCMD_AOAC_GLOBAL_INFO_GROUP_ENC_ALG(u1H2CAOACGlobalInfoParm,
			group_alg);

	ret = rtw_hal_fill_h2c_cmd(adapter,
				   H2C_AOAC_GLOBAL_INFO,
				   H2C_AOAC_GLOBAL_INFO_LEN,
				   u1H2CAOACGlobalInfoParm);

	return ret;
}

#ifdef CONFIG_PNO_SUPPORT
static u8 rtw_hal_set_scan_offload_info_cmd(_adapter *adapter,
		PRSVDPAGE_LOC rsvdpageloc, u8 enable)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapter);
	u8 u1H2CScanOffloadInfoParm[H2C_SCAN_OFFLOAD_CTRL_LEN] = {0};
	u8 res = 0, count = 0, ret = _FAIL;

	RTW_INFO("%s: loc_probe_packet:%d, loc_scan_info: %d loc_ssid_info:%d\n",
		 __func__, rsvdpageloc->LocProbePacket,
		 rsvdpageloc->LocScanInfo, rsvdpageloc->LocSSIDInfo);

	SET_H2CCMD_AOAC_NLO_FUN_EN(u1H2CScanOffloadInfoParm, enable);
	SET_H2CCMD_AOAC_NLO_IPS_EN(u1H2CScanOffloadInfoParm, enable);
	SET_H2CCMD_AOAC_RSVDPAGE_LOC_SCAN_INFO(u1H2CScanOffloadInfoParm,
					       rsvdpageloc->LocScanInfo);
	SET_H2CCMD_AOAC_RSVDPAGE_LOC_PROBE_PACKET(u1H2CScanOffloadInfoParm,
			rsvdpageloc->LocProbePacket);
	/*
		SET_H2CCMD_AOAC_RSVDPAGE_LOC_SSID_INFO(u1H2CScanOffloadInfoParm,
				rsvdpageloc->LocSSIDInfo);
	*/
	ret = rtw_hal_fill_h2c_cmd(adapter,
				   H2C_D0_SCAN_OFFLOAD_INFO,
				   H2C_SCAN_OFFLOAD_CTRL_LEN,
				   u1H2CScanOffloadInfoParm);
	return ret;
}
#endif /* CONFIG_PNO_SUPPORT */

void rtw_hal_set_fw_wow_related_cmd(_adapter *padapter, u8 enable)
{
	struct security_priv *psecpriv = &padapter->securitypriv;
	struct pwrctrl_priv *ppwrpriv = adapter_to_pwrctl(padapter);
	struct mlme_priv	*pmlmepriv = &padapter->mlmepriv;
	struct registry_priv *pregistry = &padapter->registrypriv;
	u8	pkt_type = 0, no_wake = 0;
	
	if(pregistry->suspend_type == FW_IPS_DISABLE_BBRF &&
	!check_fwstate(pmlmepriv, WIFI_ASOC_STATE))
		no_wake = 1;

	RTW_PRINT("+%s()+: enable=%d\n", __func__, enable);

	rtw_hal_set_wowlan_ctrl_cmd(padapter, enable, _FALSE);

	if (enable) {
		if(!no_wake)
			rtw_hal_set_global_info_cmd(padapter,
					    psecpriv->dot118021XGrpPrivacy,
					    psecpriv->dot11PrivacyAlgrthm);

		if (!(ppwrpriv->wowlan_pno_enable)) {
			if (!no_wake)
				rtw_hal_set_disconnect_decision_cmd(padapter,
								    enable);
#ifdef CONFIG_ARP_KEEP_ALIVE
			if ((psecpriv->dot11PrivacyAlgrthm == _WEP40_) ||
			    (psecpriv->dot11PrivacyAlgrthm == _WEP104_))
				pkt_type = 0;
			else
				pkt_type = 1;
#else
			pkt_type = 0;
#endif /* CONFIG_ARP_KEEP_ALIVE */
			if(!no_wake) {
				#ifdef CONFIG_WOW_KEEP_ALIVE_PATTERN
				rtw_hal_set_keep_alive_pattern_cmd(padapter,enable);
				#endif /*CONFIG_WOW_KEEP_ALIVE_PATTERN*/
				rtw_hal_set_keep_alive_cmd(padapter, enable, pkt_type);
                        }
		}
#ifdef CONFIG_PNO_SUPPORT
		rtw_hal_check_pno_enabled(padapter);
#endif /* CONFIG_PNO_SUPPORT */
#ifdef CONFIG_WAR_OFFLOAD
		rtw_hal_set_war_offload_ctrl_cmd(padapter, enable);
#endif /* CONFIG_WAR_OFFLOAD */

	} else {
#if 0
		{
			u32 PageSize = 0;
			rtw_hal_get_def_var(padapter, HAL_DEF_TX_PAGE_SIZE, (u8 *)&PageSize);
			dump_TX_FIFO(padapter, 4, PageSize);
		}
#endif
	}
#ifdef CONFIG_CUSTOM_PULSE
	rtw_hal_set_gpio_custom_cmd(padapter, enable);
#endif /* CONFIG_CUSTOM_PULSE */
	rtw_hal_set_remote_wake_ctrl_cmd(padapter, enable);
	RTW_PRINT("-%s()-\n", __func__);
}
#endif /* CONFIG_WOWLAN */

#ifdef CONFIG_AP_WOWLAN
static u8 rtw_hal_set_ap_wowlan_ctrl_cmd(_adapter *adapter, u8 enable)
{
	struct pwrctrl_priv *ppwrpriv = adapter_to_pwrctl(adapter);

	u8 u1H2CAPWoWlanCtrlParm[H2C_AP_WOW_GPIO_CTRL_LEN] = {0};
	u8 gpionum = 0, gpio_dur = 0;
	u8 gpio_pulse = enable;
	u8 sdio_wakeup_enable = 1;
	u8 gpio_high_active = 0;
	u8 ret = _FAIL;

#ifdef CONFIG_GPIO_WAKEUP
	gpio_high_active = ppwrpriv->is_high_active;
	gpionum = ppwrpriv->wowlan_gpio_index;
	sdio_wakeup_enable = 0;
#endif /*CONFIG_GPIO_WAKEUP*/

	RTW_INFO("%s(): enable=%d\n", __func__, enable);

	SET_H2CCMD_AP_WOW_GPIO_CTRL_INDEX(u1H2CAPWoWlanCtrlParm,
					  gpionum);
	SET_H2CCMD_AP_WOW_GPIO_CTRL_PLUS(u1H2CAPWoWlanCtrlParm,
					 gpio_pulse);
	SET_H2CCMD_AP_WOW_GPIO_CTRL_HIGH_ACTIVE(u1H2CAPWoWlanCtrlParm,
						gpio_high_active);
	SET_H2CCMD_AP_WOW_GPIO_CTRL_EN(u1H2CAPWoWlanCtrlParm,
				       enable);
	SET_H2CCMD_AP_WOW_GPIO_CTRL_DURATION(u1H2CAPWoWlanCtrlParm,
					     gpio_dur);

	ret = rtw_hal_fill_h2c_cmd(adapter,
				   H2C_AP_WOW_GPIO_CTRL,
				   H2C_AP_WOW_GPIO_CTRL_LEN,
				   u1H2CAPWoWlanCtrlParm);

	return ret;
}

static u8 rtw_hal_set_ap_offload_ctrl_cmd(_adapter *adapter, u8 enable)
{
	u8 u1H2CAPOffloadCtrlParm[H2C_WOWLAN_LEN] = {0};
	u8 ret = _FAIL;

