torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723cs/hal/hal_com.c
				struct war_mdns_service_info *psinfo = pwrctl->wowlan_war_offload_mdns_service;
				u8 txt_in_ptr[31]={ 0xc0, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 
									 0x00, 0x13, 0x09, 0x74, 0x78, 0x74, 0x76, 0x65, 0x72, 0x73, 
									 0x3d, 0x31, 0x08, 0x71, 0x74, 0x6f, 0x74, 0x61, 0x6c, 0x3d, 0x31};
				u16 mdns_offset = index - tx_desc;
				u8 i = 0;
				
				rsvd_page_loc->LocMdnsPara = *page_num;
				RTW_INFO("LocMdnsPara : %d\n", rsvd_page_loc->LocMdnsPara);
	
				/* 1. service info */
				pframe[mdns_offset] = 0x01;  // TLV(T)
				mdns_offset += 1;
				_rtw_memcpy(pframe + mdns_offset, &pwrctl->wowlan_war_offload_mdns_service_info_num, 1);
				mdns_offset += 1;
	
				for(i=0; i<pwrctl->wowlan_war_offload_mdns_service_info_num ;i++)
				{
					u16 srv_rsp_len = 0;
					
					// 1.1 : construct service name string
					//	   : length of total service name string (service+transport+domain)
					pframe[mdns_offset] = psinfo[i].service_len + psinfo[i].transport_len + psinfo[i].domain_len + 4;
					mdns_offset += 1;
	
					//	   :  service name
					pframe[mdns_offset] = psinfo[i].service_len;
					mdns_offset += 1;
					_rtw_memcpy(pframe + mdns_offset, &psinfo[i].service, psinfo[i].service_len);
					mdns_offset += psinfo[i].service_len;
	
					//	   : transport name
					pframe[mdns_offset] = psinfo[i].transport_len;
					mdns_offset += 1;
					_rtw_memcpy(pframe + mdns_offset, &psinfo[i].transport, psinfo[i].transport_len);
					mdns_offset += psinfo[i].transport_len;
	
					//	   : domain name
					pframe[mdns_offset] = psinfo[i].domain_len;
					mdns_offset += 1;
					_rtw_memcpy(pframe + mdns_offset, &psinfo[i].domain, psinfo[i].domain_len);
					mdns_offset += psinfo[i].domain_len;
	
					//	   : delimiter
					mdns_offset += 1;
	
					// 1.2 : construct type srv rsp
					pframe[mdns_offset] = psinfo[i].target_len + 19; // length
					pframe[mdns_offset + 2] = 0x21; // rsp type (srv)
					pframe[mdns_offset + 4] = 0x01; // cache flush + class
					_rtw_memcpy(pframe + mdns_offset + 5, &psinfo[i].ttl, 4); // ttl
					pframe[mdns_offset + 5] = (u8) ( (psinfo[i].ttl & 0xff000000) >> 24);	// ttl - byte0
					pframe[mdns_offset + 6] = (u8) ( (psinfo[i].ttl & 0x00ff0000) >> 16);	// ttl - byte1
					pframe[mdns_offset + 7] = (u8) ( (psinfo[i].ttl & 0x0000ff00) >> 8 );		// ttl - byte2
					pframe[mdns_offset + 8] = (u8) (psinfo[i].ttl & 0x000000ff);			// ttl - byte3
					pframe[mdns_offset + 10] = psinfo[i].target_len + 9;	  // data length
					_rtw_memcpy(pframe + mdns_offset + 15, &psinfo[i].port, 2); // port
					_rtw_memcpy(pframe + mdns_offset + 17, &psinfo[i].target_len, 1); // target len
					_rtw_memcpy(pframe + mdns_offset + 18, &psinfo[i].target, psinfo[i].target_len); // target
					pframe[mdns_offset + 18 + psinfo[i].target_len] = 0xc0; // message compresion, offset will be filled by fw.
					mdns_offset += (1 + psinfo[i].target_len + 19);
	
					// 1.3 : set the idx of txt rsp
					pframe[mdns_offset] = psinfo[i].txt_rsp_idx;
					mdns_offset += 1;
				}
				
				/* 2. machine name */
				pframe[mdns_offset] = 0x02; // TLV(T)
				mdns_offset += 1;
				_rtw_memcpy(pframe + mdns_offset, &pwrctl->wowlan_war_offload_mdns_mnane_num, 1); // NUM
				mdns_offset += 1;
	
				for(i=0; i<pwrctl->wowlan_war_offload_mdns_mnane_num; i++)
				{
					pframe[mdns_offset] = pwrctl->wowlan_war_offload_mdns_mnane[i].name_len;
					_rtw_memcpy(pframe + mdns_offset + 1, pwrctl->wowlan_war_offload_mdns_mnane[i].name, 
						pwrctl->wowlan_war_offload_mdns_mnane[i].name_len); // machine name
					mdns_offset += (1+pwrctl->wowlan_war_offload_mdns_mnane[i].name_len);
				}
				
				/* 3. A rsp */
				pframe[mdns_offset] = 0x03; // TLV(T)
				pframe[mdns_offset + 1] = 14;	// TLV(L)
				pframe[mdns_offset + 3] = 0x01; // rsp type (a)
				pframe[mdns_offset + 5] = 0x01; // cache flush + class
				pframe[mdns_offset + 9] = 0xf0; // ttl (240 sec)
				pframe[mdns_offset + 11] = 4;	// length of ipv4 addr.
				_rtw_memcpy(pframe + mdns_offset + 12, &pwrctl->wowlan_war_offload_ipv4.ip_addr[0], 4);
				mdns_offset += (2 + 14);
				
				/* 4. AAAA rsp */
				pframe[mdns_offset] = 0x04; // TLV(T)
				pframe[mdns_offset + 1] = 26;	// TLV(L)
				pframe[mdns_offset + 3] = 0x1c; // rsp type (aaaa)
				pframe[mdns_offset + 5] = 0x01; // cache flush + class
				pframe[mdns_offset + 9] = 0xf0; // ttl (240 sec)
				pframe[mdns_offset + 11] = 16;	// length of ipv6 addr.
				_rtw_memcpy(pframe + mdns_offset + 12, &pwrctl->wowlan_war_offload_ipv6.ipv6_addr[0], 16);
				mdns_offset += (2 + 26);
				
				/* 5. PTR rsp */
				pframe[mdns_offset] = 0x05; // TLV(T)
				pframe[mdns_offset + 1] = 13 + pwrctl->wowlan_war_offload_mdns_domain_name_len; // TLV(L)
				pframe[mdns_offset + 3] = 0x0c; // rsp type (aaaa)
				pframe[mdns_offset + 5] = 0x01; // cache flush + class
				pframe[mdns_offset + 8] = 0x1c; // ttl 
				pframe[mdns_offset + 9] = 0x20; // ttl (7200 sec)
				pframe[mdns_offset + 11] = 3 + pwrctl->wowlan_war_offload_mdns_domain_name_len; // data length 
				pframe[mdns_offset + 12] = pwrctl->wowlan_war_offload_mdns_domain_name_len; // domain name length 
				_rtw_memcpy(pframe + mdns_offset + 13, &pwrctl->wowlan_war_offload_mdns_domain_name, 
					pwrctl->wowlan_war_offload_mdns_domain_name_len);
				pframe[mdns_offset + 13 + pwrctl->wowlan_war_offload_mdns_domain_name_len] = 0xc0; // message compression
				mdns_offset += (2 + 13 + pwrctl->wowlan_war_offload_mdns_domain_name_len);
				
				/* 6. TXT in PTR rsp */
				pframe[mdns_offset] = 0x06; 		// TLV(T)
				pframe[mdns_offset + 1] = 31;	// TLV(L)
				_rtw_memcpy(pframe + mdns_offset + 2, &txt_in_ptr, 31);
				mdns_offset += (2 + 31);
				
				/* 7. TXT rsp */
				pframe[mdns_offset] = 0x07; // TLV(T)
				mdns_offset += 1;
				_rtw_memcpy(pframe + mdns_offset, &pwrctl->wowlan_war_offload_mdns_txt_rsp_num, 1); // NUM
				mdns_offset += 1;
	
				for(i=0; i<pwrctl->wowlan_war_offload_mdns_txt_rsp_num; i++)
				{
					u16 txt_rsp_len = pwrctl->wowlan_war_offload_mdns_txt_rsp[i].txt_len;
	
